
# Keypoint connection of bones in AIChallenger dataset:
hand_bones = [
    [0, 1],    # 手掌-大拇指
    [0, 5],    # 手掌-食指
    [0, 17],    # 手掌-小拇指

    [1, 2],    # 大拇指关节1
    [2, 3],    # 大拇指关节2
    [3, 4],    # 大拇指关节3

    [5, 6],    #食指关节1
    [6, 7],    #食指关节2
    [7, 8],   #食指关节3

    [9, 10],    #中指关节1
    [10, 11],    #中指关节2
    [11, 12],    #中指关节3

    [13, 14],    #无名指关节1
    [14, 15],    #无名指关节2
    [15, 16],    #无名指关节3

    [17, 18],    #小拇指关节1
    [18, 19],    #小拇指关节2
    [19, 20],    #小拇指关节3

    [5, 9],    #食指-中指
    [9, 13],    #中指-无名指
    [13, 17]    #无名指-小拇指
]

hand_bone_pairs = (
    ([0, 1], [0, 5]),    # 手掌-大拇指与手掌-食指
    ([0, 5], [0, 17]),    # 手掌-食指与手掌-小拇指
    ([0, 1], [0, 17]),    #手掌-大拇指与手掌-小拇指

    ([1, 2], [2, 3]),    #大拇指关节1与大拇指关节2
    ([2, 3], [3, 4]),    # 大拇指关节2与大拇指关节3
    ([1, 2], [0, 1]),    # 大拇指关节1与手掌-大拇指

    ([5, 6], [6, 7]),    #食指关节1与食指关节2
    ([6, 7], [7, 8]),    #食指关节2与食指关节3
    ([5, 6], [0, 5]),    #食指关节1与手掌-食指

    ([9, 10], [10, 11]),    #中指关节1与中指关节2
    ([10, 11], [11, 12]),    #中指关节2与中指关节3

    ([13, 14], [14, 15]),   # 无名指关节1与无名指关节2
    ([14, 15], [15, 16]),    # 无名指关节2与无名指关节3

    ([17, 18], [18, 19]),    # 小拇指关节1与小拇指关节2
    ([18, 19], [19, 20]),    # 小拇指关节2与小拇指关节3

    ([5, 6], [5, 9]),    # 食指关节1与食指-中指
    ([5, 9], [9, 10]),    # 食指-中指与中指关节1
    ([9, 13], [13, 14]),    # 中指-无名指与无名指关节1
    ([13, 17], [17, 18])    #无名指-小拇指与小拇指关节1

)



